app/views/users/show.html.erb

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."user_id" = ?  [["user_id", 2]]
---
	<div class="user_vehicles_list">
		<% current_user.vehicles.each do |vehicle| %>