app/controllers/home_controller.rb

	def unique_user_email
		respond_to do |format|
			guy_with_email = User.where(email: params[:user][:email]).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "nnn@hotmail.com"], ["LIMIT", 1]]

	def unique_mechanic_email
		respond_to do |format|
			guy_with_email = Mechanic.where(email: params[:mechanic][:email]).first
---
SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."email" = ? ORDER BY "mechanics"."id" ASC LIMIT ?  [["email", "none@hotmail.com"], ["LIMIT", 1]]