app/controllers/vehicles_controller.rb

  def create
  	@vehicle = Vehicle.new(vehicle_params)
  	if @vehicle.save
---
INSERT INTO "vehicles" ("user_id", "make", "model", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 5], ["make", "ford"], ["model", "f150"], ["created_at", 2017-03-07 04:21:01 UTC], ["updated_at", 2017-03-07 04:21:01 UTC]]

  def destroy
    @vehicle = Vehicle.find(params[:id])
    if @vehicle.destroy
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "vehicles" WHERE "vehicles"."id" = ?  [["id", 2]]